// Добавление собственного места

var add = document.getElementById("add-place");
let inputAddPlace = document.getElementById("inputAddPlace");
function insertCode() {
    if (inputAddPlace.value == "") {
        alert('Введите свое место')
    } else {
        var htmlCode = "<div class='alert alert-info'>" + document.insCode.strCode.value + "</div>";
        add.insertAdjacentHTML("afterEnd", htmlCode);
        inputAddPlace.value = "";
    }
}


// Генерирование рандома

let placeCatalog = [
    "Памятник Александру Ⅲ",
    "Остров Юность",
    "Бульвар Постышева",
    "Московские триумфальные ворота",
    "Спорт-парк Поляна",
    "Ледокол Ангара",
    "Сквер им. Кирова",
    "Стадион труд",
    "Пляж Якоби",
    "Памятник Ленину (ул. Ленина)",
    "Историко-мемориальный комплекс 'Иерусалимская гора'"
];

let cafeCatalog = [
    "INCO coffee - ​Гоголя, 79",
    "Инжинирия кофе - Карла Либкнехта, 2",
    "Инжинирия кофе - Ширямова, 32",
    "НОРА - 25 Октября, 20",
    "Cake Home - Советская, 130",
    "Cake Home - Ленина, 4",
    "Cake Home - Октябрьской Революции, 3",
    "Cake Home - Чехова, 2",
    "CASTRO CAFE - 3 Июля, 7",
    "CASTRO CAFE - Партизанская, 36",
    "CASTRO CAFE - БЦ Премьер​Рабочая, 2а/4",
    "Мария - ТРК Сильвер Молл​Сергеева, 3/5",
    "Мария - Лермонтова, 81/5",
    "Мария - Декабрьских Событий, 103",
    "Мария - Ядринцева, 90",
    "Мария - Верхняя Набережная, 145/4",
    "Мария - Байкальская, 141",
    "​Savour Coffee - Карла Либкнехта, 202",
    "Амкофе - Чехова, 19",
    "Амкофе - Степана Разина, 27",
    "Амкофе - Литвинова, 18",
    "ЦЕХ - ​Богдана Хмельницкого, 3",
    "Белая Ворона - ​Карла Маркса, 37",
    "ДАБЛБИ - ​Гагарина бульвар, 40",
    "Шоколадница - ​Декабрьских Событий, 109",
    "Traveler`s Coffee - Киевская, 7",
    "Traveler`s Coffee - Ленина, 25",
    "More Coffee - ​Дальневосточная, 144​",
    "​More Coffee - ​Николая Гаврилова, 1а",
    "​More Coffee - ​5 Армии, 29",
    "​ДАБЛБИ - ​Карла Маркса, 41/1",
    "Сова - ​Гагарина бульвар, 74",
    "COFFEE time - ​Верхняя Набережная, 145/2",
    "Mind Coffee - ​5 Армии, 48",
    "Coffee Moose - ​Партизанская, 28/2",
    "7:59 - Депутатская, 63",
    "Ку-Ку - ​Красноказачья, 76/2",





    "Та самая Подушка - Депутатская, 74Б",
    "Шэдитэ Ханза - ​Партизанская, 32",
    "Грузинский дворик - ​Строительный переулок, 8/2",
    "Соседи - ​Красных Мадьяр, 14/2",
    "Сердцеед - ​Красноказачья, 119",
    "Дорада - ​Верхняя Набережная, 145/17",
    "ШулэнДо - ​Партизанская, 28а/1",
    "Золотые палочки - ​Байкальская, 202/8",
    "WAFFEL - ​Карла Маркса, 5",
    "МОРС - ​Степана Разина, 5",
    "LUIZA - ​Авиастроителей, 16а",
    "Ежевика - ​Улан-Баторская, 2​",
    "Фокс Pizza - Безбокова, 8",
    "Фокс Pizza - Советская, 170/1",
    "Фокс Pizza - ​Декабрьских Событий, 102/1",
    "Фокс Pizza - ​Ленина, 7",
    "Фокс Pizza - ​Фридриха Энгельса, 34",
    "Додо Пицца - Депутатская, 84/2",
    "Додо Пицца - Карла Маркса, 31",
    "Кусочек солнца - Депутатская, 7/2",
    "Dadong - ​Верхняя Набережная, 145/16",
    "Стар Бургерс - Зверева, 1/3",
    "Папа Джонс - Советская, 128",
    "Папа Джонс - Мухиной, 8",
    "Папа Джонс - Лермонтова, 81/2",
    "Папа Джонс - Марата, 48",
    "Блисс - Ленина, 21",
    "Блисс - Декабрьских Событий, 105а",
    "Kimchi - ​Горная, 5/1",
    "Позная 38 - Байкальская, 124/2",
    "Позная 38 - Партизанская, 102",
    "Позная 38 - Советская, 98/1",
    "Позная 38 - ​Урицкого, 9",
    "Позная 38 - Свердлова, 36",
    "Любушка - Красноказачья, 76/1",
    "Песто Тесто - ​Улан-Баторская, 16",
    "Песто Тесто - Горького, 42"
];


let barsCatalog = [
    "Egoist - ​Карла Маркса, 15а",
    "Бахус - ​Киевская, 2",
    "Atmosphera - ​Урицкого, 8Б",
    "Chalet - ​Седова, 44",
    "Антрекот - Сухэ-Батора, 18",
    "Антрекот - 3 Июля, 25. ТРК Модный квартал",
    "Pho me - ​3 Июля, 25. ТРК Модный квартал",
    "ЦАЦКИ - ​Партизанская, 28/2",
    "SKY LOUNGE IRKUTSK - ​Ширямова, 10Б",
    "Жадина Говядина - ​Седова, 20/1",
    "Жадина Говядина - Горная, 1",
    "Жадина Говядина - Верхняя Набережная, 145/14",
    "Амстел - ​Железнодорожная 2-я, 78",
    "TRUE COST - ​Седова, 6",
    "The Rocks - ​Карла Маркса, 11/1",
    "EDISON craft bar - ​3 Июля, 33",
    "ШашлыкoFF - Седова, 14/1",
    "ШашлыкoFF - ​Дзержинского, 28",
    "Рассольник - ​3 Июля, ст3",
    "LIBERTY - ​3 Июля, 33/2",
    "Свердлов - Свердлова, 10",
    "Winkel - ​​Лермонтова, 257. БЦ Академический",
    "The Library-Biblioteka Bar - ​Каландаришвили, 9",
    "Старый Мюнхен - ​Октябрьской Революции, 3",
    "33 - ​Карла Маркса, 41/1",
    "Сморреброд - ​Тимирязева, 5",
    "Johnny Rockets - ​Тимирязева, 49",
    "Chino - ​Байкальская, 208",
    "GRAFF - Степана Разина, 26",
    "Кружаль - ​3 Июля, 1а",
    "Руки Вверх - Байкальская, 206",
    "Почём Харчо - ​Верхняя Набережная, 145/3",
    "Pafos - ​Байкальская, 23а",
    "MOLCHANOV BAR - ​Карла Маркса, 41/1",
    "Harat`s pub - Дальневосточная, 158/6",
    "Harat`s pub - Байкальская, 108",
    "Harat`s pub - Советская, 124д",
    "Harat`s pub - Седова, 2",
    "Harat`s pub - Лермонтова, 81/1",
    "bbb - ​Карла Маркса, 41/1",
    "One more bar - ​Литвинова, 1",
    "Tipsy tiki bar - ​Байкальская, 23/2",
    "Design Bar - ​Карла Маркса, 40",
    "PUBLIC BAR - Советская, 3",
    "Gin Fizz - Баррикад, 51/2",
    "Kiss - ​Верхняя Набережная, 145/17а",
    "Rock`n`Roll PUB - Киевская, 24",




    "Andreano - Верхняя Набережная, 10",
    "Суши Студио - Байкальская, 253Б",
    "Суши Студио - Ядринцева, 8а",
    "Суши Студио - Седова, 18",
    "Суши Студио - Лермонтова, 275/15",
    "Суши Студио - ​Карла Маркса, 18",
    "Хочу Пури - ​Советская, 58/1",
    "Cooperrest - ​Карла Либкнехта, 94",
    "Ривьера - ​Лыткина, 42а",
    "Пекинская Утка - ​Сухэ-Батора, 7",
    "Академия Караоке - ​Ширямова, 32/1",
    "Sushi House - ​Юрия Тена проезд, 27",
    "Академия Караоке - 3 Июля, 33/2",
    "Happy - ​Красноказачья, 119",
    "Бабушка - Иркутской 30-й Дивизии, 26/3",
    "Перчини Grill & Wine - ​Верхняя Набережная, 10",
    "Перчини Grill & Wine - ​Советская, 58/1. МТЦ НОВЫЙ​",
    "Крылошная - ​Ширямова, 40ж",
    "Маршал - ​Маршала Жукова проспект, 36а/3",
    "Чайхана Казан Топчан - ​Красных Мадьяр, 50/2",
    "Prego - ​Карла Маркса, 15а"
];

let place = [

];
let time = [
    "00:00", //0
    "00:30", //1
    "01:00", //2
    "01:30", //3
    "02:00", //4
    "02:30", //5
    "03:00", //6
    "03:30", //7 
    "04:00", //8
    "04:30", //9
    "05:00", //10
    "05:30", //11
    "06:00", //12
    "06:30", //13
    "07:00", //14
    "07:30", //15
    "08:00", //16
    "08:30", //17
    "09:00", //18
    "09:30", //19
    "10:00", //20
    "10:30", //21
    "11:00", //22
    "11:30", //23
    "12:00", //24
    "12:30", //25
    "13:00", //26
    "13:30", //27
    "14:00", //28
    "14:30", //29
    "15:00", //30
    "15:30", //31
    "16:00", //32
    "16:30", //33
    "17:00", //34
    "17:30", //35
    "18:00", //36
    "18:30", //37
    "19:00", //38
    "19:30", //39
    "20:00", //40
    "20:30", //41
    "21:00", //42
    "21:30", //43
    "22:00", //44
    "22:30", //45
    "23:00", //46
    "23:30", //47
    "24:00" //48
];

var timeList = document.getElementById("time"),
    placeList = document.getElementById("place"),
    btn = document.getElementById("btn"),
    popular = document.getElementById('checkbox-popular'),
    bars = document.getElementById('checkbox-bars'),
    cafe = document.getElementById('checkbox-cafe');

let addPlace = document.getElementsByClassName('alert-info');
btn.addEventListener('click', function () {
    console.log('asd');
    btn.animate([
        { transform: 'translateY(0)' },
        { transform: 'translateY(-15px)' },
        { transform: 'translateY(0)' },
        { transform: 'translateY(-8px)' },
        { transform: 'translateY(0)' }
    ], {
        duration: 700,
        easing: 'ease-in'
    })
});


/* --------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------
ГЛАВНАЯ КНОПКА В ПРИЛОЖЕНИЕ
-----------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------- */

btn.addEventListener("click", function () {

    place = [];

    // РАБОТА checkbox
    if (popular.checked) {
        place.push(...placeCatalog);
    }
    if (bars.checked) {
        place.push(...barsCatalog);
    }
    if (cafe.checked) {
        place.push(...cafeCatalog);
    }

    console.log(place);

    // РАБОТА select
    var selectFrom = document.getElementById("select-from"),
        selectTo = document.getElementById("select-to");
    var valueFrom = selectFrom.value;
    var valueTo = selectTo.value;
    if (valueFrom >= valueTo) {
        alert('Введите корректный промежуток времени');
    }
    var timeArr = time.slice(valueFrom, valueTo);




    // ДОБАВЛЕНИЕ СОБСТВЕННОГО МЕСТА
    var places_as_arr = Array.from(addPlace);

    places_as_arr.forEach(function (place_item, i, places_as_arr) {
        place.push(place_item.innerHTML);
    });



    if (place == "") {
        alert('Нет мест для выбора');
        return false;
    }

    // ГЕНЕРАЦИЯ РАНДОМА
    let rndTime = Math.floor(Math.random() * (timeArr.length - 0) + 0);
    let rndPlace = Math.floor(Math.random() * (place.length - 0) + 0);
    timeList.textContent = timeArr[rndTime];
    placeList.textContent = place[rndPlace];
    btn.textContent = "Еще разок?";
});
